/* 
* Filename:    writeTime.ino
* Revision:    1.0
* Date:        2019/06/03
* Author:      hceng
* Email:       huangcheng.job@foxmail.com
* Website:     http://www.100ask.net/
* Function:    Write Real Time ClockM.
* Notes:       Onboard RTC at I2C0.
* Description: 
* 1. 实例化RTC，传入参数为对应的I2C接口编号；
* 2. 定义时间结构体Time，为每个成员设置值，介绍如下：
+----------+-----------+------------+-----------------------------------------+
| variable |  meaning  |    range   |                   note                  |
+----------+-----------+------------+-----------------------------------------+
|   year   |     年    |  2000-2099 |                                         |
+----------+-----------+------------+-----------------------------------------+
|   month  |     月    |    1-12    |                                         |
+----------+-----------+------------+-----------------------------------------+
|    day   |     日    |    1-31    |                                         |
+----------+-----------+------------+-----------------------------------------+
|   week   |    星期   |     0-6    |       0为周日，1为星期一，以此类推      |
+----------+-----------+------------+-----------------------------------------+
|   hour   |     时    |    00-23   |                  24进制范围             |
+----------+-----------+------------+-----------------------------------------+
|  minute  |     分    |    0-59    |                                         |
+----------+-----------+------------+-----------------------------------------+
|  second  |     秒    |    0-59    |                                         |
+----------+-----------+------------+-----------------------------------------+

* 3. 使用setTime()设置时间，传入前面设置好的Time结构体；
* 4. 循环里，间隔1S,使用timePrintf()打印RTC模块时间
*/
#include <Arduino.h>
#include <rtc.h>

int main(int argc, char **argv)
{
    int ret;
    RTC rtc(I2C_A);
    
    Time t;
    t.year = 2019;
    t.month = 6;
    t.day = 3;
    t.week = 1;

    t.hour = 23;  
    t.minute = 59;
    t.second = 57;
    
    ret = rtc.setTime(t);
    if (ret < 0)
    {
        cout << "setTime error" << endl;
        return -1;
    }
    
    while(1)
    {
        rtc.timePrintf();
        sleep(1);
    } 
    
    return 0;
}
